[
    {"id":"Michael_Reed", "name":"Michael Reed", "linkedIn":"https://www.linkedin.com/in/michael-reed-320a1a59", "recommendation":"I highly recommend Bentley Davis without reservation. Bentley was contracted to make upgrades to existing, proprietary software. He showed imagination and self-motivation to demonstrate how the system could be improved—without changing the original intent and overall function of the software. At every turn, he has gone above and beyond my expectations. Bentley works hard, honors his commitments in time and budget, and (most importantly) delivers. I got to know Bentley personally. I found him to be honest, open, and easy to communicate with.", "autoUpdate":true},
    {"id":"Debby_Kruzic", "name":"Debby Kruzic", "linkedIn":"https://www.linkedin.com/in/privacy-driventechplatformfounder/", "recommendation":"Bentley provided invaluable feedback with our startup. He took the time to learn about us first and came prepared with questions and suggestions for improvements. Very thoughtful feedback and organized. I look forward to working with him in the future.", "autoUpdate":true},
    {"id":"Roderick_Turner", "name":"Roderick Turner", "linkedIn":"https://www.linkedin.com/in/roderick-turner-ba540744/", "recommendation":"Bentley was vital in helping TOPit onboard a new development team. Also, he gave insight on what metrics and objectives to measure for success in this business unit. We really appreciate that help. TOPit Team", "autoUpdate":true},
    {"id":"Kusha_Gharahi", "name":"Kusha Gharahi", "linkedIn":"https://www.linkedin.com/in/kushagharahi/", "recommendation":"Few people have the opportunity to report to a CTO/boss who is also a coach and mentor. Bentley is one of those unicorns I've had the pleasure of reporting to these past few years. I worked with Bentley from the inception of CancerGene Connect until we were acquired by Invitae (plus some). Not only did he help shape me into the developer I am today, but he provided lots of mentoring and guidance on my personal side projects outside of work. To quote him, \"Yep, life is a team sport\". Working with Bentley, every mistake was a learning opportunity. Any employee or company would be lucky to have Bentley call the shots.", "autoUpdate":true},
    {"id":"Jama_Terry_Ball", "name":"Jama Terry Ball", "linkedIn":"https://www.linkedin.com/in/jamaterryball/", "recommendation":"Bentley Davis is a fearless innovator. In the years that we worked together, he consistently rose to the challenge of developing technology in an ever changing environment. He is not afraid to suggest options or express his opinion. He receives constructive feedback well, and learns to adapt quickly as the need arises, both as a leader and a colleague. For the \"techie\" that he truly is, his team members and colleagues, along with myself, have benefited from the \"heart\" in his leadership style.. He has an unflagging spirit and determination to see things through that will serve him well in any professional path he chooses. It would be both my pleasure and privilege to work with him again.", "autoUpdate":true},
    {"id":"Cheryl_Robertson", "name":"Cheryl Robertson", "linkedIn":"https://www.linkedin.com/in/cheryl-robertson-24061a14/", "recommendation":"I originally worked with Bentley prior to reporting to him and found that he was very easy to work with. As a manager, he always wants his employees to excel and grow. I worked for Bentley for over 2 years, he gives his employees the freedom to work alone but he always makes himself available to them if they need help. Bentley is always in a learning mode himself, which always puts his employees in a learning mode.", "autoUpdate":true}
]